cases/artigo_mestrado/on-caso-1.2/_grid/P3900_d1e19_linear/fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// on-caso-1 FLUIDO - 2 zonas:
//   sas         - SAS regular z=[0, 30], 8 blocos hex (5760 cells), CSF
//   peri_porous - lid poroso  z=[30, 30.5], 8 blocos hex (384 cells), CSF + Darcy
//
// Patches:
//   inlet            z=0,    r=1.55-2.35  fixedValue p=P_CSF (cisterna)
//   fsi_pia          r=1.55, z=[0,30]     FSI conformal (preCICE + solid)
//   fsi_dura         r=2.35, z=[0,30]     FSI conformal
//   lid_wall_inner   r=1.55, z=[30,30.5]  wall parado (pos-cribrosa rigida)
//   lid_wall_outer   r=2.35, z=[30,30.5]  wall parado
//   outlet_peri      z=30.5, r=1.55-2.35  fixedValue p=0 (drenagem venosa)
//
// As faces em z=30 sao INTERNAS entre sas e peri_porous (continuidade).
// A indexacao de vertices: z_idx_fluid=0 (z=0), 1 (z=30), 2 (z=30.5).
// FSI conformity: vertices nas layers PIA, SAS_MID, SAS em z=0 e z=30 tem
// coordenadas identicas as do solido (mesmas formulas em diag_for_layer).

scale   0.001;


vertices
(
    (    0.750000     0.750000    0.000 )  //   0
    (   -0.750000     0.750000    0.000 )  //   1
    (   -0.750000    -0.750000    0.000 )  //   2
    (    0.750000    -0.750000    0.000 )  //   3
    (    1.060660     1.060660    0.000 )  //   4
    (   -1.060660     1.060660    0.000 )  //   5
    (   -1.060660    -1.060660    0.000 )  //   6
    (    1.060660    -1.060660    0.000 )  //   7
    (    1.096016     1.096016    0.000 )  //   8
    (   -1.096016     1.096016    0.000 )  //   9
    (   -1.096016    -1.096016    0.000 )  //  10
    (    1.096016    -1.096016    0.000 )  //  11
    (    1.414214     1.414214    0.000 )  //  12
    (   -1.414214     1.414214    0.000 )  //  13
    (   -1.414214    -1.414214    0.000 )  //  14
    (    1.414214    -1.414214    0.000 )  //  15
    (    1.661701     1.661701    0.000 )  //  16
    (   -1.661701     1.661701    0.000 )  //  17
    (   -1.661701    -1.661701    0.000 )  //  18
    (    1.661701    -1.661701    0.000 )  //  19
    (    1.767767     1.767767    0.000 )  //  20
    (   -1.767767     1.767767    0.000 )  //  21
    (   -1.767767    -1.767767    0.000 )  //  22
    (    1.767767    -1.767767    0.000 )  //  23
    (    0.750000     0.750000   30.000 )  //  24
    (   -0.750000     0.750000   30.000 )  //  25
    (   -0.750000    -0.750000   30.000 )  //  26
    (    0.750000    -0.750000   30.000 )  //  27
    (    1.060660     1.060660   30.000 )  //  28
    (   -1.060660     1.060660   30.000 )  //  29
    (   -1.060660    -1.060660   30.000 )  //  30
    (    1.060660    -1.060660   30.000 )  //  31
    (    1.096016     1.096016   30.000 )  //  32
    (   -1.096016     1.096016   30.000 )  //  33
    (   -1.096016    -1.096016   30.000 )  //  34
    (    1.096016    -1.096016   30.000 )  //  35
    (    1.414214     1.414214   30.000 )  //  36
    (   -1.414214     1.414214   30.000 )  //  37
    (   -1.414214    -1.414214   30.000 )  //  38
    (    1.414214    -1.414214   30.000 )  //  39
    (    1.661701     1.661701   30.000 )  //  40
    (   -1.661701     1.661701   30.000 )  //  41
    (   -1.661701    -1.661701   30.000 )  //  42
    (    1.661701    -1.661701   30.000 )  //  43
    (    1.767767     1.767767   30.000 )  //  44
    (   -1.767767     1.767767   30.000 )  //  45
    (   -1.767767    -1.767767   30.000 )  //  46
    (    1.767767    -1.767767   30.000 )  //  47
    (    0.750000     0.750000   30.500 )  //  48
    (   -0.750000     0.750000   30.500 )  //  49
    (   -0.750000    -0.750000   30.500 )  //  50
    (    0.750000    -0.750000   30.500 )  //  51
    (    1.060660     1.060660   30.500 )  //  52
    (   -1.060660     1.060660   30.500 )  //  53
    (   -1.060660    -1.060660   30.500 )  //  54
    (    1.060660    -1.060660   30.500 )  //  55
    (    1.096016     1.096016   30.500 )  //  56
    (   -1.096016     1.096016   30.500 )  //  57
    (   -1.096016    -1.096016   30.500 )  //  58
    (    1.096016    -1.096016   30.500 )  //  59
    (    1.414214     1.414214   30.500 )  //  60
    (   -1.414214     1.414214   30.500 )  //  61
    (   -1.414214    -1.414214   30.500 )  //  62
    (    1.414214    -1.414214   30.500 )  //  63
    (    1.661701     1.661701   30.500 )  //  64
    (   -1.661701     1.661701   30.500 )  //  65
    (   -1.661701    -1.661701   30.500 )  //  66
    (    1.661701    -1.661701   30.500 )  //  67
    (    1.767767     1.767767   30.500 )  //  68
    (   -1.767767     1.767767   30.500 )  //  69
    (   -1.767767    -1.767767   30.500 )  //  70
    (    1.767767    -1.767767   30.500 )  //  71
);

blocks
(
    // ===== SAS regular annulus z=0-30 (8 blocos: sas_in + sas_out) =====
    hex (  11  15  12   8   35  39  36  32 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_E
    hex (   8  12  13   9   32  36  37  33 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_N
    hex (   9  13  14  10   33  37  38  34 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_W
    hex (  10  14  15  11   34  38  39  35 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_S
    hex (  15  19  16  12   39  43  40  36 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_E
    hex (  12  16  17  13   36  40  41  37 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_N
    hex (  13  17  18  14   37  41  42  38 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_W
    hex (  14  18  19  15   38  42  43  39 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_S

    // ===== Peri-porous lid annulus z=30-30.5 (8 blocos, cellZone Darcy) =====
    hex (  35  39  36  32   59  63  60  56 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_in_E
    hex (  32  36  37  33   56  60  61  57 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_in_N
    hex (  33  37  38  34   57  61  62  58 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_in_W
    hex (  34  38  39  35   58  62  63  59 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_in_S
    hex (  39  43  40  36   63  67  64  60 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_out_E
    hex (  36  40  41  37   60  64  65  61 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_out_N
    hex (  37  41  42  38   61  65  66  62 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_out_W
    hex (  38  42  43  39   62  66  67  63 )  peri_porous  ( 3 8 2 )  simpleGrading ( 1 1 1 )  // lid_out_S
);

edges
(
    // ---- pia     r=1.55  @ z=0.000 mm ----
    arc   8  11  (   1.55000    0.00000    0.000 )
    arc   8   9  (   0.00000    1.55000    0.000 )
    arc   9  10  (  -1.55000    0.00000    0.000 )
    arc  10  11  (   0.00000   -1.55000    0.000 )
    // ---- sas_mid r=2.00  @ z=0.000 mm ----
    arc  12  15  (   2.00000    0.00000    0.000 )
    arc  12  13  (   0.00000    2.00000    0.000 )
    arc  13  14  (  -2.00000    0.00000    0.000 )
    arc  14  15  (   0.00000   -2.00000    0.000 )
    // ---- sas     r=2.35  @ z=0.000 mm ----
    arc  16  19  (   2.35000    0.00000    0.000 )
    arc  16  17  (   0.00000    2.35000    0.000 )
    arc  17  18  (  -2.35000    0.00000    0.000 )
    arc  18  19  (   0.00000   -2.35000    0.000 )

    // ---- pia     r=1.55  @ z=30.000 mm ----
    arc  32  35  (   1.55000    0.00000   30.000 )
    arc  32  33  (   0.00000    1.55000   30.000 )
    arc  33  34  (  -1.55000    0.00000   30.000 )
    arc  34  35  (   0.00000   -1.55000   30.000 )
    // ---- sas_mid r=2.00  @ z=30.000 mm ----
    arc  36  39  (   2.00000    0.00000   30.000 )
    arc  36  37  (   0.00000    2.00000   30.000 )
    arc  37  38  (  -2.00000    0.00000   30.000 )
    arc  38  39  (   0.00000   -2.00000   30.000 )
    // ---- sas     r=2.35  @ z=30.000 mm ----
    arc  40  43  (   2.35000    0.00000   30.000 )
    arc  40  41  (   0.00000    2.35000   30.000 )
    arc  41  42  (  -2.35000    0.00000   30.000 )
    arc  42  43  (   0.00000   -2.35000   30.000 )

    // ---- pia     r=1.55  @ z=30.500 mm ----
    arc  56  59  (   1.55000    0.00000   30.500 )
    arc  56  57  (   0.00000    1.55000   30.500 )
    arc  57  58  (  -1.55000    0.00000   30.500 )
    arc  58  59  (   0.00000   -1.55000   30.500 )
    // ---- sas_mid r=2.00  @ z=30.500 mm ----
    arc  60  63  (   2.00000    0.00000   30.500 )
    arc  60  61  (   0.00000    2.00000   30.500 )
    arc  61  62  (  -2.00000    0.00000   30.500 )
    arc  62  63  (   0.00000   -2.00000   30.500 )
    // ---- sas     r=2.35  @ z=30.500 mm ----
    arc  64  67  (   2.35000    0.00000   30.500 )
    arc  64  65  (   0.00000    2.35000   30.500 )
    arc  65  66  (  -2.35000    0.00000   30.500 )
    arc  66  67  (   0.00000   -2.35000   30.500 )

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (  11  15  12   8 )   // sas_in_E
            (   8  12  13   9 )   // sas_in_N
            (   9  13  14  10 )   // sas_in_W
            (  10  14  15  11 )   // sas_in_S
            (  15  19  16  12 )   // sas_out_E
            (  12  16  17  13 )   // sas_out_N
            (  13  17  18  14 )   // sas_out_W
            (  14  18  19  15 )   // sas_out_S
        );
    }

    fsi_pia
    {
        type wall;
        faces
        (
            (  11   8  32  35 )   // fsi_pia_E
            (   8   9  33  32 )   // fsi_pia_N
            (   9  10  34  33 )   // fsi_pia_W
            (  10  11  35  34 )   // fsi_pia_S
        );
    }

    fsi_dura
    {
        type wall;
        faces
        (
            (  19  16  40  43 )   // fsi_dura_E
            (  16  17  41  40 )   // fsi_dura_N
            (  17  18  42  41 )   // fsi_dura_W
            (  18  19  43  42 )   // fsi_dura_S
        );
    }

    lid_wall_inner
    {
        type wall;
        faces
        (
            (  35  32  56  59 )   // lid_in_inner_E
            (  32  33  57  56 )   // lid_in_inner_N
            (  33  34  58  57 )   // lid_in_inner_W
            (  34  35  59  58 )   // lid_in_inner_S
        );
    }

    lid_wall_outer
    {
        type wall;
        faces
        (
            (  43  40  64  67 )   // lid_out_outer_E
            (  40  41  65  64 )   // lid_out_outer_N
            (  41  42  66  65 )   // lid_out_outer_W
            (  42  43  67  66 )   // lid_out_outer_S
        );
    }

    outlet_peri
    {
        type patch;
        faces
        (
            (  59  63  60  56 )   // lid_in_top_E
            (  56  60  61  57 )   // lid_in_top_N
            (  57  61  62  58 )   // lid_in_top_W
            (  58  62  63  59 )   // lid_in_top_S
            (  63  67  64  60 )   // lid_out_top_E
            (  60  64  65  61 )   // lid_out_top_N
            (  61  65  66  62 )   // lid_out_top_W
            (  62  66  67  63 )   // lid_out_top_S
        );
    }

);

